Revit 2024 API
BuiltInFailures.SketchFailures.EndsNotOnEdge Property
 Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EndsNotOnEdge { get; }
Visual Basic
Public Shared ReadOnly Property EndsNotOnEdge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EndsNotOnEdge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace